Catalogs/ПрограммыОбученияСотрудниковПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыОбученияСотрудниковПоОхранеТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбученияМинтруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПрограммОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитсяПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляВсехРабочихМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРаз</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСОтрывомОтПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСменуРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ФормыОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФормыОбученияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПрограммыОбученияСотрудниковПоОхранеТруда/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УчебноеЗаведение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	
	ЗначенияРеквизитовПередЗаписью = МенеджерОбъекта.ЗначенияРеквизитовПрограммыОбученияПередЗаписью(Ссылка);
	
	// Соответствие флага контроля проведения обучения пометке удаления.
	Если Не ЭтоНовый() И КонтролироватьПроведение И ПометкаУдаления Тогда
		Если Не ЗначенияРеквизитовПередЗаписью.ПометкаУдаления Тогда
			КонтролироватьПроведение = Ложь;
		ИначеЕсли Не ЗначенияРеквизитовПередЗаписью.КонтролироватьПроведение Тогда
			ПометкаУдаления = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроводитсяПовторно Тогда
		СтруктураПериода = Новый Структура("КоличествоРаз, КоличествоПериодов, Периодичность", КоличествоРаз, КоличествоПериодов, Периодичность);
		ПредставлениеПериода = ОхранаТруда.ПредставлениеПериодаПоСтруктуре(СтруктураПериода);
	Иначе
		ПредставлениеПериода = "Однократно";
		КоличествоРаз = 0;
		КоличествоПериодов = 0;
		Периодичность = Неопределено;
	КонецЕсли;
	
	ОбучениеПоОхранеТруда.ЗаполнитьРеквизитыТабличнойЧастиПоРабочимМестам(ЭтотОбъект);
	
	МенеджерОбъекта.ОбновитьПериодическиеОбученияПоОхранеТруда(ЗначенияРеквизитовПередЗаписью, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
